from prozorro.risks.rules.sas24_3_14_1 import RiskRule as BaseRiskRule


class RiskRule(BaseRiskRule):
    identifier = "sas24-3-14-2"
    name = "Незастосування відкритих торгів з особливостями під час закупівлі робіт"
    description = (
        "Визначення закупівель, що містять ознаки поділу предмета закупівлі через здійснення замовником протягом року "
        "закупівлі робіт за одним предметом без проведення відкритих торгів з особливостями на суму, що дорівнює "
        "або перевищує 1,5 млн грн, та/або свідчать про ймовірність допущення таких порушень."
    )
    procurement_categories = ("works",)
    value_for_works = 1500000
